// **div 와 span
// 둘 다 영역을 만드는 태그이며 div는 블럭 요소라서 주위에 콘텐츠가 배치될 수 없고 span 은 인라인 요소이기 때문에
// 주위에 콘텐츠가 배치될 수 있다.
// 아래 코드에서 span 을 div 로 변경하면서 확인해 보자
// register.html

// **CSS
// 스타일시트라고 부르기도 하는데 HTML 에 디자인을 적용하기 위한 언어
// 1. 사용법
// 1-1. 외부에 파일을 만들고 링크를 이용해서 사용
// 1-2. html 문서 내에 style 태그를 만들고 작성해서 사용
// 1-3. 태그 안에 style 이라는 속성을 이용해 작성해서 사용
// # 3번째 방법은 권장하지는 않는다.

// 2. 작성 방법
//    선택자{속성 값;...}
//    속성과 값의 구분은 :
//    여러 개의 속성을 사용할 때는 반득시 ; 으로 구분해야 한다.

// 3. 선택자
// 3-1. *
//      모든 태그를 선택
// 3-2. 태그
//      태그는 태그 이름만 기재
// 3-3. 클래스
//      클래스 이름 앞에 . 을 추가해서 기재
// 3-4. 아이디
//      아이디 앞에 # 를 추가해서 기재
//      WebContent 디렉토리에 css 디렉토리를 만들고 temp.css 
// ex) style.html 파일을 생성

// 3-5. 속성 선택자
//      선택자[속성]: 선택자 중에 속성이 있는 경우만 적용
//      선택자[속성="값"]: 선택자 중에서 속성의 값이 일치하는 경우 = 대신에 
//                      ^= 을 사용하면 시작하는 이다.
//                      $= 는 종료하는 이다.
//                      ^= 는 포함하는 이다.
// 3-6. 가상 선택자
//      동작을 취했을 때를 나타내는 선택자 이다.
//      link 와 visited 는 a 태그에 적용하는 것으로 처음 보여질 때와 한 번이라도 누른 경우의 디자인을 변경하는 경우에 사용
//      hover 는 마우스를 올려 놓은 경우이다.
//      active 는 마우스로 클릭한 경우이다.
//      가상 선택자는 선택자 뒤에 : 를 붙이고 입력한다.
// ex) temp.css 파일에 추가
//     h3.hover{color:gray;}
//     h3:active{color:yellow;}

// 3-7. 선택자 조합
//      , : or 의 개념으로 또는 이다.
//      ex) a, p : a 와 p 태그 모두
//      공백 : 하위의 개념이다.
//      ex) p a : p 태그 안에 있는 a 태그
//      > : 자식의 개념 : 바로 아래 레벨에 존재해야 한다.
//      ex) p > a : p 태그 안에 있는 a 태그이며 다른 태그에 포함되면 안 된다.
//      + : 바로 뒤의 형제이다.
//      ~ : 모든 형제 태그이다.

// ex) 목록에 사용할 이미지 파일을 프로젝트에 추가
//     WebContent 디렉토리에 images 디렉토리를 만들고 파일을 복사
//     WebContent 디렉토리에 style2.html 

// **Vendor Prefix
// 아래 사이트에서 작업 한 후 코드를 복사해서 사용하는 것이 편리합니다.
// http://www.colorzilla.com/gradient-editor
// CSS3 는 아직 브라우저 별로 합의가 이루어지지 않은 항목이 있다.
// 이런 항목은 브라우저가 자신의 접두어를 붙여서 별도로 제공한다.
// 이 때 사용하는 접두어를 Vendor Prefix 라고 한다.
// IE 는 ms, safari 와 chrome 은 webkit 이라고 하고 firefox 는 moz 를 사용한다.
// 이런 접두어가 붙은 기능은 다른 브라우저에 적용하려고 하면 다른 브라우저의 접두어를 이용하여 전부 설정해야 한다.

// **Box Model
// div 와 같은 영역을 의미한다.
// width 와 height 는 콘텐츠를 표시하는 영역의 가로와 세로 크기
// border 는 경계선
// padding 은 경계선과 콘텐트와의 여백
// margin 은 다른 Box 와의 여백
// IE 하위 버전에서는 padding 이 콘텐츠 영역에 포함된다.
// IE 와 다른 브라우저는 박스의 크기가 다르게 설정되는 경우가 있다.
// 실제 개발을 할 때는 대부분 padding 은 0으로 설정한다.
// margin 은 여러 개가 동시에 적용되는 것이 아니라 여러 개 중에서 큰 것 하나만 적용된다.

// **float 속성
// 박스를 왼쪽이나 오른쪽에 떠 있는 것처럼 만들어서 다른 콘텐츠를 배치 할 수 있도록 해 주는 속성

// **overflow
// 영역의 크기보다 큰 콘텐츠를 표시할 때 사용할 옵션
// 값으로는 visible(영역을 넘겨서 출력), hidden(영역을 넘긴 부분은 안 보이도록 설정), 
// scroll(스크롤 바를 생성) 이 있고 auto 도 있는데 
// 원래 auto 는 브라우저 설정마다 다르다고 알려져 있으나
// 현재 사용하는 대다수 브라우저는 scroll 로 설정되어 있다.
// 많은 양의 데이터를 출력해야 하는 테이블의 경우에도 이 기능을 이용하여 틀 고정을 해 주는 것이 좋다.

// **display 속성을 이용하면 특정 태그들을 테이블이나 테이블의 행 또는 셀로 변환이 가능하다.
// 외부에서 데이터를 XML 로 받아왔을 때 테이블로 출력하고자 하는 경우에 사용한다.

// # html 파일을 만들고 외부에 스타일시트 파일을 만들고 링크를 설정해서 적용하기
// html 파일 내에 style 을 설정해서 적용하기
// 태그 내에 style 속성을 이용해서 적용하기




package Web;

public class 필기0810 {

}
