// # 안드로이드 개발 툴 주소
// https://developer.android.com/sdk/index.html

// **모바일 애플리케이션 개발 방법
// 1. Native App
// 	  모바일 운영 체제에서 지원하는 공식언어를 이용해 애플리케이션을 제작
//    안드로이드는 Java 또는 Kotlin, iOS 는 Objective-C 나 Swift 로 제작
//    실행 속도가 빠르고 하드웨어의 모든 기능을 사용 가능
//    단점은 동일한 애플리케이션을 2개의 모바일 기기에서 동작시키려면 각각의 언어로 2번을 제작해야 한다.

// 2. Hybrid App 이나 별도의 Framework 를 이용해 개발
//    Abdroid 용과 iOS 운영체제의 앱을 하나의 언어로 개발해서 각각 빌드하는 형태로 애플리케이션을 개발
//    동일한 기능을 수행하는 애플리케이션을 1개만 제작
//    하드웨어 기능을 일부분 사용할 수 있다.
//    단점으로는 실행 속도가 느리고 최신 운영체제에 맞는 애플리케이션 개발이 어려움

// 3. Web App
//    모바일 용 웹 애플리케이션을 만들고 그 모바일 웹 애플리케이션을 웹 뷰를 이용해 출력하는 구조
//    유지보수가 용이하다.(웹 애플리케이션을 수정하면 앱에 바로 반영되기 때문)
//    Native App 이나 Hybrid App 은 수정을 하게 되면 심사를 다시 받아야 한다.
//    하드웨어 기능이 매우 제한적이고 인터넷이 연결되어 있어야 하며 결재를 할 수 없다.


// **안드로이드 에서의 리소스 관리
// 리소스를 프로젝트에 추가하면 R.java 파일에 정수형 상수로 등록을 해서 사용
// 리소스는 영문 소문자와 숫자만 사용이 가능하고 영문 소문자로 시작해야 한다.
// 


package Web;

public class 필기0927 {

}
